app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    id = params["id"]
   @student = Student.find(id)